app/Http/Controllers/Auth/LoginController.php

select * from `users` inner join `emails` on `email` = `emails`.`email` where `email` = 'aashishpokhrel146@gmail.com' limit 1
---
    public function authenticate(Request $request)
    {
        $user = $request->validate([
            'email'     => 'required',
            'password'  => 'required|min:6'
        ]);
        $user = User::join('emails', 'email', 'emails.email')
            ->where('email', $request->input('email'))
            ->first();