app/Http/Controllers/HomeController.php

select * from `documents` where `user_id` = 12
select * from `emails` where `emails`.`user_id` in (1)
select * from `phones` where `phones`.`user_id` in (1)
---
    public function index()
    {
        $documents = Document::where('user_id', Auth::user()->id)->get();

        return view(
            'pages.home',
            [
                'loggedUser' => auth()->user()->with('emails', 'phones')->find(Auth::user()->id),
                'documents' => $documents,
                'show_navbar' => true,


            ],

        );