app/Http/Controllers/MainController.php

    public function home()
    {
        $users = User::all();
        $documents = DB::table('users')
            ->join('documents', 'users.id', '=', 'documents.user_id')
            ->select('users.*', 'documents.path', 'documents.type')
            ->get();
---
select * from `users`
select `users`.*, `documents`.`path`, `documents`.`type` from `users` inner join `documents` on `users`.`id` = `documents`.`user_id`