app/Http/Controllers/SubCategoryController.php

    public function destroy($id)
    {
        SubCategory::find($id)->delete();
---
select * from `sub_categories` where `sub_categories`.`category_id` in (2)