app/Http/Controllers/UserController.php

    public function getprofileImage(Request $request)
    {
        $document = Document::where('user_id', Auth::user()->id)->get();
        $category = Category::with('sub_categories')->get();
---
select * from `documents` where `user_id` = 12
select * from `sub_categories` where `sub_categories`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)