app/Models/User.php

    public function email()
    {
        if(!auth()->user()->emails->where('primary', true))
            return auth()->user()->emails->where('primary', true)->first()->email;
        else
            return auth()->user()->emails->first()->email;
---
select * from `emails` where `emails`.`user_id` = 12 and `emails`.`user_id` is not null